; domain
(define (domain grid-visitAll)
(:requirements :strips :typing :negative-preconditions)
(:types
place - object
)
(:predicates
	(at-robot ?x1 - place)
	(visited ?x1 - place)
	(connected ?x1 - place ?x2 - place)
)
(:action move
	:parameters (?x1 - place ?x2 - place )
	:precondition (and
	(not(at-robot ?x2))
	(at-robot ?x1)
	(connected ?x1 ?x2))
	:effect (and
	(at-robot ?x2)
	(not(at-robot ?x1)))
)
(:action visit
	:parameters (?x1 - place )
	:precondition (and
	(at-robot ?x1)
	(not(visited ?x1)))
	:effect (and
	(visited ?x1))
)
)

; problem
(define (problem grid-3)
(:domain grid-visitAll)
(:objects
	loc-x0-y0
	loc-x0-y1
	loc-x0-y2
	loc-x1-y0
	loc-x1-y1
	loc-x1-y2
	loc-x2-y0
	loc-x2-y1
	loc-x2-y2
- place

)
(:init
	(at-robot loc-x1-y1)
	(visited loc-x1-y1)
	(connected loc-x0-y0 loc-x1-y0)
 	(connected loc-x0-y0 loc-x0-y1)
 	(connected loc-x0-y1 loc-x1-y1)
 	(connected loc-x0-y1 loc-x0-y0)
 	(connected loc-x0-y1 loc-x0-y2)
 	(connected loc-x0-y2 loc-x1-y2)
 	(connected loc-x0-y2 loc-x0-y1)
 	(connected loc-x1-y0 loc-x0-y0)
 	(connected loc-x1-y0 loc-x2-y0)
 	(connected loc-x1-y0 loc-x1-y1)
 	(connected loc-x1-y1 loc-x0-y1)
 	(connected loc-x1-y1 loc-x2-y1)
 	(connected loc-x1-y1 loc-x1-y0)
 	(connected loc-x1-y1 loc-x1-y2)
 	(connected loc-x1-y2 loc-x0-y2)
 	(connected loc-x1-y2 loc-x2-y2)
 	(connected loc-x1-y2 loc-x1-y1)
 	(connected loc-x2-y0 loc-x1-y0)
 	(connected loc-x2-y0 loc-x2-y1)
 	(connected loc-x2-y1 loc-x1-y1)
 	(connected loc-x2-y1 loc-x2-y0)
 	(connected loc-x2-y1 loc-x2-y2)
 	(connected loc-x2-y2 loc-x1-y2)
 	(connected loc-x2-y2 loc-x2-y1)

)
(:goal
(and
	(visited loc-x0-y0)
	(visited loc-x0-y2)
	(visited loc-x1-y1)
	(visited loc-x2-y0)
	(visited loc-x2-y1)
)
)
)

; plan
1. (move loc-x1-y1 loc-x0-y1)
   deleted: (at-robot loc-x1-y1)
   added: (at-robot loc-x0-y1)
   goals met: 1 of 5
2. (move loc-x0-y1 loc-x0-y0)
   deleted: (at-robot loc-x0-y1)
   added: (at-robot loc-x0-y0)
   goals met: 1 of 5
3. (visit loc-x0-y0)
   added: (visited loc-x0-y0)
   goals met: 2 of 5
4. (move loc-x0-y0 loc-x0-y1)
   deleted: (at-robot loc-x0-y0)
   added: (at-robot loc-x0-y1)
   goals met: 2 of 5
5. (move loc-x0-y1 loc-x0-y2)
   deleted: (at-robot loc-x0-y1)
   added: (at-robot loc-x0-y2)
   goals met: 2 of 5
6. (visit loc-x0-y2)
   added: (visited loc-x0-y2)
   goals met: 3 of 5
7. (move loc-x0-y2 loc-x1-y2)
   deleted: (at-robot loc-x0-y2)
   added: (at-robot loc-x1-y2)
   goals met: 3 of 5
8. (move loc-x1-y2 loc-x1-y1)
   deleted: (at-robot loc-x1-y2)
   added: (at-robot loc-x1-y1)
   goals met: 3 of 5
9. (move loc-x1-y1 loc-x2-y1)
   deleted: (at-robot loc-x1-y1)
   added: (at-robot loc-x2-y1)
   goals met: 3 of 5
10. (visit loc-x2-y1)
   added: (visited loc-x2-y1)
   goals met: 4 of 5
11. (move loc-x2-y1 loc-x2-y0)
   deleted: (at-robot loc-x2-y1)
   added: (at-robot loc-x2-y0)
   goals met: 4 of 5
12. (visit loc-x2-y0)
   added: (visited loc-x2-y0)
   goals met: 5 of 5
